Tekla.Structures.AnalysisInternal.DotAnalysisPartPositionProperties
Serialization structure for AnalysisPartPositionProperties.

Tekla.Structures.AnalysisInternal.DotAnalysisPartPositionProperties._AxisLocation
The axis location of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisPartPositionProperties._AxisModifierX
The axis modifier in X direction.

Tekla.Structures.AnalysisInternal.DotAnalysisPartPositionProperties._AxisCoordinateX
The axis coordinate in X direction.

Tekla.Structures.AnalysisInternal.DotAnalysisPartPositionProperties._AxisModifierY
The axis modifier in Y direction.

Tekla.Structures.AnalysisInternal.DotAnalysisPartPositionProperties._AxisCoordinateY
The axis coordinate in X direction.

Tekla.Structures.AnalysisInternal.DotAnalysisPartPositionProperties._AxisModifierZ
The axis modifier in > direction.

Tekla.Structures.AnalysisInternal.DotAnalysisPartPositionProperties._AxisCoordinateZ
The axis coordinate in X direction.

Tekla.Structures.AnalysisInternal.DotAnalysisPartPositionProperties._AxisOffset
The axis offset of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisPartPositionProperties._KeepAxis
The keep axis setting.

Tekla.Structures.AnalysisInternal.DotAnalysisPartPositionProperties._LongitudinalOffsetMode
The longitudinal offset mode.

Tekla.Structures.AnalysisInternal.DotAnalysisPartPositionProperties.ToStruct(Tekla.Structures.Analysis.AnalysisPartPositionProperties)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisPartPositionProperties.FromStruct(Tekla.Structures.Analysis.AnalysisPartPositionProperties)
DO NOT USE! For internal usage only!
P: P.